src/cf/src/InformationRegisters/ЗадачиВРаботе/ЗадачиВРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиВРаботе</name>
  <resources>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <resources>
    <name>Затрачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонПлановыхЗатрат</name>
    <type>
      <types>CatalogRef.ШаблоныПлановыхТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЗадачиВРаботе/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Начать фиксацию времени на задачу
//
// Параметры:
//  Исполнитель	 - СправочникСсылка.Пользователи 
//  Задача		 - ЗадачаСсылка.ЗадачиПользователя 
//  ТипРаботы	 - ПеречислениеСсылка.ТипыРаботПоЗадачам
//
Процедура НачатьРаботуСЗадачей(Исполнитель, Задача, Знач ТипРаботы = Неопределено) Экспорт
	
	Если ТипРаботы = Неопределено Тогда
		
		ТипРаботы = Перечисления.ТипыРаботПоЗадачам.ПустаяСсылка();
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = Исполнитель;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран()
		И МенеджерЗаписи.Задача = Задача
		И МенеджерЗаписи.ТипРаботы = ТипРаботы Тогда
		// В работе находится текущая задача, ничего не меняем.
		
		Возврат;
		
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();
	Попытка
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			// В работе находится другая задача. Учтем время, затраченное на нее.
			РегистрыСведений.УчетРабочегоВремени.ЗафиксироватьПотраченноеВремяПоЗадаче(Исполнитель, МенеджерЗаписи.Задача, 
				МенеджерЗаписи.ДатаНачала, ТекущаяДата, МенеджерЗаписи.ТипРаботы);
			
		Иначе
			
			МенеджерЗаписи.Исполнитель = Исполнитель;
			
		КонецЕсли;
		
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.ДатаНачала = ТекущаяДата;
		МенеджерЗаписи.ТипРаботы = ТипРаботы;
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение; 
		
	КонецПопытки;
	
КонецПроцедуры

// Приостановить работу с задачей
//
// Параметры:
//  Исполнитель	 - СправочникСсылка.Пользователи 
//  Задача		 - ЗадачаСсылка.ЗадачиПользователя 
//  Комментарий	 - Строка
//
Процедура ПриостановитьРаботуСЗадачей(Исполнитель, Задача, Комментарий = "") Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = Исполнитель;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если МенеджерЗаписи.Задача <> Задача Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();
	
	Попытка
				
		РегистрыСведений.УчетРабочегоВремени.ЗафиксироватьПотраченноеВремяПоЗадаче(Исполнитель, Задача, МенеджерЗаписи.ДатаНачала, 
			ТекущаяДата, МенеджерЗаписи.ТипРаботы, Комментарий);
		МенеджерЗаписи.Удалить();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение; 
		
	КонецПопытки;
				
КонецПроцедуры

#КонецОбласти

#КонецЕсли
